#### In this notebook, the movie data is reworked and new data about crew, director, writers, and actors is included. Then this data will be prepared as SQL tables that can be used in Tableau and Power BI.

# Create Project

## Load Libraries and Functions

In [1]:
# import pandas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

## Load Data

In [2]:
# imdb urls for datasets
names_url = "https://datasets.imdbws.com/name.basics.tsv.gz"
crew_url = "https://datasets.imdbws.com/title.crew.tsv.gz"
principals_url = "https://datasets.imdbws.com/title.principals.tsv.gz"

In [3]:
# loading the data
names = pd.read_csv(names_url, sep='\t', low_memory=False)
crew = pd.read_csv(crew_url, sep='\t', low_memory=False)
principals = pd.read_csv(principals_url, sep='\t', low_memory=False)

# viewing the data
display(names.head(), crew.head(), principals.head())

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0075213"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,music_department","tt0056404,tt0054452,tt0049189,tt0057345"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0080455,tt0072562,tt0077975,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050976,tt0050986,tt0083922,tt0069467"

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

## Get previous data

### AKAs

In [4]:
akas_url = "https://datasets.imdbws.com/title.akas.tsv.gz"

akas_df = pd.read_csv(akas_url, sep = "\t", low_memory = False)
akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [5]:
# get US movies
akas_filter = akas_df["region"] == "US"

akas_df = akas_df[akas_filter]

akas_df["region"].value_counts()

US    1451624
Name: region, dtype: int64

In [6]:
#Removing all \N values
akas_df = akas_df.replace({"\\N":np.nan})

akas_df.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

### Ratings

In [7]:
ratings_url = "https://datasets.imdbws.com/title.ratings.tsv.gz"

ratings_df = pd.read_csv(ratings_url, sep = "\t", low_memory = False)
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
2  tt0000003            6.5      1848
3  tt0000004            5.5       178
4  tt0000005            6.2      2630

In [8]:
#Filtering out non-US ratings
ratings_in_US_filter = ratings_df["tconst"].isin(akas_df["titleId"])

ratings_df = ratings_df[ratings_in_US_filter]
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
4  tt0000005            6.2      2630
5  tt0000006            5.1       182
6  tt0000007            5.4       824

In [9]:
#Removing all \N values
ratings_df = ratings_df.replace({"\\N":np.nan})

ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1987
1  tt0000002            5.8       265
4  tt0000005            6.2      2630
5  tt0000006            5.1       182
6  tt0000007            5.4       824

In [10]:
#Checking for duplicated values
ratings_df.duplicated().sum()

0

In [11]:
# also need the basics to work this new data
basics_url = "https://datasets.imdbws.com/title.basics.tsv.gz"

basics_df = pd.read_csv(basics_url, sep = "\t", low_memory = False)
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

### Basics

In [12]:
#Filtering out non-US movies
movies_in_US_filter = basics_df["tconst"].isin(akas_df["titleId"])

basics_df = basics_df[movies_in_US_filter]
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,\N,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,\N,1,"Short,Sport"

In [13]:
#Checking for duplicated values
ratings_df.duplicated().sum()

0

In [14]:
# Removing all \N values
basics_df = basics_df.replace({"\\N": np.nan})

basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,NaN,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,NaN,1,"Short,Sport"

In [15]:
#Filtering out non-movies
isMovie = basics_df["titleType"] == "movie"
basics_df = basics_df[isMovie]

basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
144,tt0000147,movie,The Corbett-Fitzsimmons Fight,The Corbett-Fitzsimmons Fight,0,1897,NaN,100,"Documentary,News,Sport"
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama
625,tt0000630,movie,Hamlet,Amleto,0,1908,NaN,NaN,Drama

In [16]:
#Changing startYear to be an int
basics_df["startYear"] = basics_df["startYear"].astype(float)

#Filters for movies from 2000-2021 inclusive
isOlderThan2000 = basics_df["startYear"] >= 2000
isYoungerThan2022 = basics_df["startYear"] <= 2021

basics_df = basics_df[isOlderThan2000 & isYoungerThan2022]

#Checking to make sure filters work
basics_df.describe()

           startYear
count  135077.000000
mean     2013.186893
std         5.608232
min      2000.000000
25%      2009.000000
50%      2014.000000
75%      2018.000000
max      2021.000000

### Crew

In [17]:
#Filtering out crew that are not in basics
movies_in_basics_filter = crew["tconst"].isin(basics_df["tconst"])

crew = crew[movies_in_basics_filter]
crew.head()

          tconst            directors              writers
34802  tt0035423            nm0003506  nm0737216,nm0003506
61114  tt0062336  nm0749914,nm0765384  nm0749914,nm1146177
67666  tt0069049            nm0000080  nm0000080,nm0462648
86793  tt0088751  nm0078540,nm0628399            nm0628399
93930  tt0096056            nm0324875  nm0234502,nm0324875

In [18]:
# Removing all \N values
crew = crew.replace({"\\N": np.nan})

crew.head()

          tconst            directors              writers
34802  tt0035423            nm0003506  nm0737216,nm0003506
61114  tt0062336  nm0749914,nm0765384  nm0749914,nm1146177
67666  tt0069049            nm0000080  nm0000080,nm0462648
86793  tt0088751  nm0078540,nm0628399            nm0628399
93930  tt0096056            nm0324875  nm0234502,nm0324875

In [19]:
#check for duplicates
crew.duplicated().sum()

0

In [20]:
#Splitting writers and directors into lists
crew["directors_split"] = crew["directors"].str.split(',')
crew["writers_split"] = crew["writers"].str.split(',')
crew.head()

,tconst,directors,writers,directors_split,writers_split
34802,tt0035423,nm0003506,"nm0737216,nm0003506",[nm0003506],"[nm0737216, nm0003506]"
61114,tt0062336,"nm0749914,nm0765384","nm0749914,nm1146177","[nm0749914, nm0765384]","[nm0749914, nm1146177]"
67666,tt0069049,nm0000080,"nm0000080,nm0462648",[nm0000080],"[nm0000080, nm0462648]"
86793,tt0088751,"nm0078540,nm0628399",nm0628399,"[nm0078540, nm0628399]",[nm0628399]
93930,tt0096056,nm0324875,"nm0234502,nm0324875",[nm0324875],"[nm0234502, nm0324875]"

In [21]:
#Removing unnecessary directors and writers columns
crew = crew.drop(columns = ["directors", "writers"])
crew.head()

          tconst         directors_split           writers_split
34802  tt0035423             [nm0003506]  [nm0737216, nm0003506]
61114  tt0062336  [nm0749914, nm0765384]  [nm0749914, nm1146177]
67666  tt0069049             [nm0000080]  [nm0000080, nm0462648]
86793  tt0088751  [nm0078540, nm0628399]             [nm0628399]
93930  tt0096056             [nm0324875]  [nm0234502, nm0324875]

In [22]:
#Exploding directors and writers
crew = crew.explode("directors_split")
crew = crew.explode("writers_split")
crew.head()

          tconst directors_split writers_split
34802  tt0035423       nm0003506     nm0737216
34802  tt0035423       nm0003506     nm0003506
61114  tt0062336       nm0749914     nm0749914
61114  tt0062336       nm0749914     nm1146177
61114  tt0062336       nm0765384     nm0749914

In [23]:
#Renaming directors and writers columns
crew = crew .rename(columns = {"directors_split": "director", "writers_split": "writer"})
crew.head()

          tconst   director     writer
34802  tt0035423  nm0003506  nm0737216
34802  tt0035423  nm0003506  nm0003506
61114  tt0062336  nm0749914  nm0749914
61114  tt0062336  nm0749914  nm1146177
61114  tt0062336  nm0765384  nm0749914

In [24]:
#create unique writers and directors
unique_director = crew["director"].unique()
unique_director

unique_writer = crew["writer"].unique()
unique_writer

array(['nm0737216', 'nm0003506', 'nm0749914', ..., 'nm5412267',
       'nm6743460', 'nm3471432'], dtype=object)

### Principals

In [25]:
#Filtering out principals that are not in basics
movies_in_basics_filter = principals["tconst"].isin(basics_df["tconst"])

principals = principals[movies_in_basics_filter]
principals.head()

           tconst  ordering     nconst category job         characters
283499  tt0035423        10  nm0107463   editor  \N                 \N
283500  tt0035423         1  nm0000212  actress  \N     ["Kate McKay"]
283501  tt0035423         2  nm0413168    actor  \N        ["Leopold"]
283502  tt0035423         3  nm0000630    actor  \N  ["Stuart Besser"]
283503  tt0035423         4  nm0005227    actor  \N  ["Charlie McKay"]

In [26]:
# Removing all \N values
principals= principals.replace({"\\N": np.nan})

principals.head()

           tconst  ordering     nconst category  job         characters
283499  tt0035423        10  nm0107463   editor  NaN                NaN
283500  tt0035423         1  nm0000212  actress  NaN     ["Kate McKay"]
283501  tt0035423         2  nm0413168    actor  NaN        ["Leopold"]
283502  tt0035423         3  nm0000630    actor  NaN  ["Stuart Besser"]
283503  tt0035423         4  nm0005227    actor  NaN  ["Charlie McKay"]

In [27]:
#Checking for duplicates
principals.duplicated().sum()

0

In [28]:
#Filtering out crew
names_in_principals_filter = names["nconst"].isin(principals["nconst"])
names_in_directors_filter = names["nconst"].isin(unique_director)
names_in_writers_filter = names["nconst"].isin(unique_writer)

names = names[names_in_principals_filter | 
                    names_in_directors_filter |
                    names_in_writers_filter]
names.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0075213"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,music_department","tt0056404,tt0054452,tt0049189,tt0057345"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0080455,tt0072562,tt0077975,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050976,tt0050986,tt0083922,tt0069467"

## Names

In [29]:
# Removing all \N values
names = names.replace({"\\N": np.nan})

names.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0075213"
2,nm0000003,Brigitte Bardot,1934,NaN,"actress,soundtrack,music_department","tt0056404,tt0054452,tt0049189,tt0057345"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0080455,tt0072562,tt0077975,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050976,tt0050986,tt0083922,tt0069467"

In [30]:
#Checking for duplicates
names.duplicated().sum()

0

# Save Data to file

In [31]:
#rename akas and basics
akas=akas_df
basics=basics_df
ratings=ratings_df

In [32]:
# viewing the data
display(names.info(), crew.info(), principals.info(), akas.info(), 
        ratings.info(), basics.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 592712 entries, 0 to 12690299
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   nconst             592712 non-null  object
 1   primaryName        592712 non-null  object
 2   birthYear          101092 non-null  object
 3   deathYear          13375 non-null   object
 4   primaryProfession  549912 non-null  object
 5   knownForTitles     591685 non-null  object
dtypes: object(6)
memory usage: 31.7+ MB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 301945 entries, 34802 to 10011503
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    301945 non-null  object
 1   director  297701 non-null  object
 2   writer    272846 non-null  object
dtypes: object(3)
memory usage: 9.2+ MB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1062187 entries, 283499 to 57208107
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   tconst      1062187 non-null  object
 1   ordering    1062187 non-null  int64
 2   nconst      1062187 non-null  object
 3   category    1062187 non-null  object
 4   job         201620 non-null   object
 5   characters  454357 non-null   object
dtypes: int64(1), object(5)
memory usage: 56.7+ MB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1451624 entries, 5 to 36553146
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1451624 non-null  object
 1   ordering         1451624 non-null  int64
 2   title            1451624 non-null  object
 3   region           1451624 non-null  object
 4   language         4009 non-null     object
 5   types            981272 non-null   object
 6   attributes       46992 non-null    object
 7   isOriginalTitle  1450282 non-null  object
dtypes: int64(1), object(7)
memory usage: 99.7+ MB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 503636 entries, 0 to 1330555
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         503636 non-null  object
 1   averageRating  503636 non-null  float64
 2   numVotes       503636 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 15.4+ MB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 135077 entries, 34802 to 10009008
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          135077 non-null  object
 1   titleType       135077 non-null  object
 2   primaryTitle    135077 non-null  object
 3   originalTitle   135077 non-null  object
 4   isAdult         135077 non-null  object
 5   startYear       135077 non-null  float64
 6   endYear         0 non-null       object
 7   runtimeMinutes  115908 non-null  object
 8   genres          132133 non-null  object
dtypes: float64(1), object(8)
memory usage: 10.3+ MB

None

None

None

None

None

None

In [33]:
#Making data folder if one does not already exist
FOLDER = "New_Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_crew.csv.gz',
 'title_names.csv.gz',
 'title_principals.csv.gz',
 'title_ratings.csv.gz']

In [34]:
## Save current dataframes to file.
akas.to_csv("New_Data/title_akas.csv.gz",compression='gzip',index=False)
ratings.to_csv("New_Data/title_ratings.csv.gz",compression='gzip',index=False)
basics.to_csv("New_Data/title_basics.csv.gz",compression='gzip',index=False)
crew.to_csv("New_Data/title_crew.csv.gz",compression='gzip',index=False)
principals.to_csv("New_Data/title_principals.csv.gz",compression='gzip',index=False)
names.to_csv("New_Data/title_names.csv.gz",compression='gzip',index=False)

# SQL Prep

In [35]:
import pandas as pd
import os
import numpy as np

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *


import pymysql
pymysql.install_as_MySQLdb()

In [36]:
## UPDATE THESE VARIABLES TO MATCH YOUR OWN PC/DATABASE
# MySQL Database to export 
DB_NAME = "new_movie"

# Json file with mysql login credentials
MYSQL_LOGIN = "C:\\Users\\Elizabeth Spreng\\.secret\\mysql.json"
USER_KEY = "user"
PASSWORD_KEY = "password"

## (Optional) - Change folder
folder = "New_Data_Viz/"

In [41]:
## Change username and password to match your personal MySQL Server settings
username = "root"
password = "Ahimsa81981182!"

movie = f'mysql+pymysql://{username}:{password}@localhost/movies'
engine = create_engine(movie)

## Libraries for SQL

In [43]:
# Check if the database exists. If not, create it.
if database_exists(movie) == False:
  create_database(movie)
else:
  print('The database already exists!')

The database already exists!

##  Reload the data

In [44]:
# load the  cleaned data
basics = pd.read_csv('Data/title_basics.csv.gz')
aka = pd.read_csv('New_Data/title_akas.csv.gz')
rating = pd.read_csv('New_Data/title_ratings.csv.gz')
crew = pd.read_csv('New_Data/title_crew.csv.gz')
principals = pd.read_csv('New_Data/title_principals.csv.gz')
names = pd.read_csv('New_Data/title_names.csv.gz')

### Basics with Genres

In [45]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
81757,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
81758,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81759,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
81760,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81761,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

#### Genres need to be exploded

In [46]:
#create a column and indentify types
genres_split =basics['genres'].str.split(',')
genres_split =basics['genres'].str.split('<')
unique_genres=genres_split.explode().unique()
unique_genres

array(['Comedy,Fantasy,Romance', 'Drama,History', 'Drama',
       'Comedy,Horror,Sci-Fi', 'Comedy,Drama,Fantasy', 'Biography,Drama',
       'Comedy,Mystery', 'Musical,Romance', 'Action,Adventure,Drama',
       'Action', 'Action,Crime,Drama', 'Action,Thriller',
       'Action,Adventure,Fantasy', 'Drama,Romance', 'Drama,Music,Romance',
       'Comedy,Horror,Mystery', 'Crime,Drama,Thriller', 'Comedy,Drama',
       'Comedy', 'Action,Adventure,Animation', 'Comedy,Drama,Romance',
       'Comedy,Romance', 'Drama,Thriller', 'Comedy,Drama,Sci-Fi',
       'Adventure,Family,Fantasy', 'Drama,History,War',
       'Adventure,Animation,Comedy', 'Action,Drama,Sci-Fi',
       'Biography,Drama,Romance', 'Horror,Mystery,Thriller',
       'Comedy,Drama,Thriller', 'Animation,Family,Musical',
       'Drama,Mystery,Thriller', 'Action,Adventure,Thriller',
       'Action,Horror,Sci-Fi', 'Action,Adventure,Sci-Fi',
       'Action,Adventure,Comedy', 'Animation,Drama,Family',
       'Comedy,Family', 'Comedy,Crime', 'Comedy,Crime,Romance',
       'Crime,Thriller', 'Drama,Mystery,Romance', 'Horror',
       'Action,Crime', 'Adventure,Animation,Drama', 'Action,Crime,Sci-Fi',
       'Action,Drama,Sport', 'Thriller', 'Action,Crime,Fantasy',
       'Fantasy', 'Adventure,Animation,Family', 'Horror,Mystery',
       'Comedy,Drama,Music', 'Horror,Sci-Fi,Thriller',
       'Drama,Family,Western', 'Animation,Comedy,Sci-Fi', 'Adult',
       'Crime,Drama', 'Crime,Drama,Romance', 'Drama,Music', 'Action,War',
       'Action,Drama', 'Crime,Drama,Horror', 'Crime,Fantasy,Mystery',
       'Comedy,Romance,Sci-Fi', 'Adventure,Comedy,Crime',
       'Drama,History,Thriller', 'Drama,Fantasy,Sport', 'Action,Comedy',
       'Comedy,Crime,Drama', 'Drama,Romance,Western',
       'Action,Drama,Musical', 'Adult,Crime,Mystery',
       'Biography,Crime,Drama', 'Comedy,Horror', 'Comedy,Drama,Family',
       'Comedy,Sci-Fi', 'Horror,Thriller', 'Comedy,Family,Romance',
       'Action,Drama,Thriller', 'Adventure,Drama,Romance',
       'Action,Adventure,Crime', 'Crime,Drama,Mystery',
       'Drama,Mystery,Sci-Fi', 'Drama,Horror,Thriller',
       'Drama,Romance,Thriller', 'Comedy,Music,Romance', 'Drama,Family',
       'Drama,Thriller,War', 'Drama,Horror,Mystery',
       'Biography,Drama,History', 'Action,Crime,Thriller',
       'Comedy,Crime,Mystery', 'Comedy,Thriller', 'Action,Sci-Fi',
       'Adventure,Comedy,Drama', 'Crime,Horror', 'Comedy,Family,Mystery',
       'Animation,Comedy,Fantasy', 'Fantasy,Horror',
       'Action,Romance,Thriller', 'Adventure,Biography,Drama',
       'Action,Comedy,Crime', 'Comedy,Drama,Mystery',
       'Crime,Drama,Musical', 'Drama,Musical,Sport',
       'Comedy,Family,Fantasy', 'Drama,War', 'Action,Drama,Romance',
       'Crime,Horror,Mystery', 'Comedy,Crime,Thriller',
       'Animation,Drama,History', 'Adventure,Comedy,Family',
       'Comedy,Romance,Western', 'Biography,Drama,Music',
       'Adventure,Comedy,Romance', 'Action,Comedy,Romance',
       'Drama,Western', 'Action,Comedy,Sci-Fi', 'Comedy,Fantasy',
       'Comedy,Drama,Sport', 'Romance,Sci-Fi', 'Action,Crime,Mystery',
       'Action,Comedy,Fantasy', 'Crime,Drama,Music',
       'Comedy,Musical,Romance', 'Comedy,Music',
       'Adventure,Sci-Fi,Thriller', 'Action,Adventure,Romance',
       'Adventure,Family', 'Action,Drama,History',
       'Action,Mystery,Thriller', 'Mystery,Thriller', 'Comedy,Musical',
       'Drama,Sport', 'Drama,Fantasy,Romance', 'Adventure,Comedy,Fantasy',
       'Drama,Horror', 'Family', 'Action,Drama,Fantasy',
       'Drama,Music,Thriller', 'Comedy,Sport', 'Drama,History,Romance',
       'Comedy,Mystery,Romance', 'Comedy,Crime,Fantasy',
       'Action,Sci-Fi,Thriller', 'Comedy,Family,Sport',
       'Animation,Comedy,Musical', 'Crime,Horror,Thriller',
       'Action,Fantasy', 'Drama,Family,Sci-Fi', 'Drama,Romance,Sport',
       'Action,Animation', 'Biography,Comedy,Drama', 'Drama,Romance,War',
       'Drama,Sci-Fi', 'Drama,Sci-Fi,Thriller', 'Adventure,Animation',
       'Mystery', 'Sci-Fi', 'Drama,Musical,Romance',
       'Action,Comedy,Thriller', 'Crime', 'Comedy,Romance,Sport',
       'Action,Adventure', 'Drama,Fantasy', 'Comedy,Drama,History',
       'Crime,Mystery,Thriller', 'Adventure', 'Action,Comedy,Drama',
       'Family,Horror', 'Romance,Thriller', 'Animation,Biography,Drama',
       'Adventure,Animation,Sci-Fi', 'Crime,Horror,Sci-Fi',
       'Drama,Fantasy,Horror', 'Action,Fantasy,Horror', 'Fantasy,Mystery',
       'Biography,Drama,Sport', 'Comedy,Horror,Romance', 'Drama,Musical',
       'Crime,Mystery,Romance', 'Drama,Romance,Sci-Fi',
       'Fantasy,Horror,Mystery', 'Adventure,Comedy', 'Comedy,History',
       'Action,Horror,Thriller', 'Action,Drama,War',
       'Action,Mystery,Sci-Fi', 'Adventure,Drama',
       'Action,Animation,Drama', 'Comedy,Fantasy,Horror', 'Drama,Mystery',
       'Crime,Drama,Fantasy', 'Drama,Fantasy,Mystery',
       'Adventure,Drama,Family', 'Animation,Family,Fantasy',
       'Comedy,Drama,Musical', 'Comedy,Fantasy,Sci-Fi',
       'Mystery,Romance,Sci-Fi', 'Crime,Drama,History', 'Fantasy,Romance',
       'Drama,Fantasy,Music', 'Fantasy,Sci-Fi', 'Adventure,Comedy,Sport',
       'Crime,Romance,Thriller', 'Action,Western', 'Sci-Fi,Thriller',
       'Animation,Comedy,Drama', 'Adventure,Fantasy,Horror',
       'Animation,Comedy,Family', 'Action,Musical,Romance',
       'Family,Fantasy', 'Comedy,Drama,War', 'Comedy,Horror,Thriller',
       'Drama,War,Western', 'Horror,Mystery,Romance', 'Crime,Romance',
       'Action,Adventure,Family', 'Adventure,Drama,History', 'Romance',
       'Comedy,Mystery,Sci-Fi', 'Animation,Drama,Fantasy',
       'Comedy,Musical,Sci-Fi', 'Adventure,Drama,Fantasy',
       'Action,Sci-Fi,Sport', 'Animation,Crime,Drama',
       'Drama,Fantasy,Thriller', 'Action,Horror,Mystery',
       'Drama,Family,Fantasy', 'Action,Biography,Drama', 'Horror,Sci-Fi',
       'Thriller,Western', 'Animation', 'Comedy,Crime,Horror',
       'Action,Adventure,Horror', 'Action,Fantasy,Thriller',
       'Fantasy,Mystery,Romance', 'Action,History',
       'Action,Fantasy,Sci-Fi', 'Drama,Music,War', 'Drama,Family,Sport',
       'Horror,War', 'Family,Thriller', 'Animation,Family',
       'Adventure,Comedy,Mystery', 'Action,Drama,Family',
       'Horror,Mystery,Sci-Fi', 'Horror,Romance', 'Drama,Fantasy,Musical',
       'Fantasy,Horror,Thriller', 'Western', 'Biography,Comedy,Crime',
       'Adventure,Romance', 'Comedy,Crime,Family', 'Comedy,Family,Sci-Fi',
       'Comedy,Mystery,Thriller', 'Crime,Drama,Sport',
       'Drama,Family,Romance', 'Horror,Western', 'Action,Comedy,Horror',
       'Comedy,Western', 'Action,Animation,Horror',
       'Action,Animation,Crime', 'Adventure,Drama,Thriller',
       'Action,Drama,Music', 'Comedy,Family,Music', 'Adventure,Western',
       'Action,Comedy,Mystery', 'Drama,Fantasy,War',
       'Action,Adventure,Biography', 'Comedy,Romance,Thriller',
       'Crime,Horror,Romance', 'Drama,Fantasy,Sci-Fi',
       'Comedy,Crime,Musical', 'Action,Comedy,Family',
       'Mystery,Sci-Fi,Thriller', 'Mystery,Western',
       'Drama,Horror,Sci-Fi', 'Biography,Drama,Family',
       'Action,Crime,Horror', 'Biography,War', 'Action,Drama,Horror',
       'Comedy,Drama,Horror', 'Adventure,Animation,Musical',
       'Drama,Horror,Musical', 'Crime,Drama,War', 'Crime,Mystery',
       'Adventure,Animation,Biography', 'Adventure,Mystery,Thriller',
       'Animation,Sci-Fi', 'Animation,Comedy', 'Biography,Crime,Horror',
       'Adventure,Animation,Romance', 'Comedy,War', 'Adventure,Fantasy',
       'Horror,Thriller,Western', 'Drama,Horror,Romance',
       'Adventure,Drama,Mystery', 'Adventure,Horror,Thriller', 'War',
       'Action,Sport', 'Adventure,Horror,Mystery', 'Action,Drama,Mystery',
       'Biography,Drama,Mystery', 'Comedy,Fantasy,Mystery', 'Adult,Drama',
       'Drama,Fantasy,History', 'Drama,Music,Musical',
       'Adventure,Horror,Sci-Fi', 'Action,Romance,Sci-Fi',
       'Action,Crime,Romance', 'Action,Biography,Crime',
       'Drama,History,Music', 'Music', 'Drama,History,Musical',
       'Action,Horror', 'Action,Adventure,War', 'Drama,History,Sport',
       'Action,Drama,Western', 'History', 'Action,Comedy,Musical',
       'Action,Comedy,Western', 'Adventure,Fantasy,Sci-Fi', 'Musical',
       'Comedy,Crime,Music', 'Action,Adventure,Mystery',
       'Animation,Drama,Mystery', 'Fantasy,Horror,Romance',
       'Adventure,Comedy,Horror', 'Action,Animation,Comedy',
       'Adult,Animation,Horror', 'Family,Music,Musical',
       'Adventure,Drama,War', 'Music,Sci-Fi', 'Animation,Horror,Sci-Fi',
       'Drama,Family,Mystery', 'Animation,Comedy,Horror',
       'Crime,Drama,Family', 'Adventure,Comedy,Music', 'Animation,Drama',
       'Adventure,Crime,Drama', 'Adventure,Animation,Music',
       'Adventure,Comedy,Sci-Fi', 'Animation,Drama,Sci-Fi',
       'Adventure,Drama,Horror', 'Crime,Mystery,Sci-Fi',
       'Adventure,Thriller', 'Animation,Drama,Romance',
       'Action,Animation,Sport', 'Action,Sci-Fi,Western',
       'Action,Animation,Family', 'Adventure,Animation,Fantasy',
       'Crime,Musical', 'Drama,Sport,Thriller', 'Comedy,Horror,Musical',
       'Action,Animation,Sci-Fi', 'Action,Animation,Romance',
       'Fantasy,Horror,Sci-Fi', 'Crime,Horror,Western',
       'Animation,Fantasy', 'Biography,Drama,Musical',
       'Mystery,Romance,Thriller', 'Comedy,Crime,Sport',
       'Animation,Drama,Thriller', 'Animation,Drama,Horror',
       'Thriller,War', 'Action,History,War', 'Animation,Comedy,Crime',
       'Fantasy,Western', 'Action,Romance,War', 'Sport',
       'Adventure,Biography,Comedy', 'Action,Horror,War',
       'Action,Thriller,War', 'Biography,Drama,War',
       'Drama,Family,Musical', 'Crime,Drama,Western', 'Horror,Musical',
       'Comedy,Horror,Music', 'Horror,Music,Sci-Fi',
       'Biography,Comedy,Romance', 'Action,Romance',
       'Drama,History,Horror', 'Adventure,Mystery',
       'Adventure,Family,History', 'Family,Musical',
       'Action,Thriller,Western', 'Adventure,Sci-Fi',
       'Action,Fantasy,Musical', 'Action,Biography',
       'Drama,Music,Mystery', 'Drama,Family,War',
       'Family,Fantasy,Mystery', 'Action,Adventure,Music',
       'Mystery,Sci-Fi', 'Fantasy,Thriller', 'Family,Western',
       'Adventure,Comedy,Western', 'Adventure,Fantasy,Thriller',
       'Comedy,History,War', 'Action,Adventure,History',
       'Adventure,Biography,War', 'Comedy,Fantasy,Music',
       'Biography,Comedy,Sci-Fi', 'Adventure,Drama,Sci-Fi',
       'Biography,Drama,Fantasy', 'Biography', 'Comedy,Fantasy,Musical',
       'Adventure,Drama,Sport', 'Adventure,Family,Mystery',
       'Biography,Crime,Thriller', 'Adult,Fantasy', 'Biography,History',
       'Family,Sport', 'Horror,Romance,Thriller',
       'Adventure,Family,Western', 'Adventure,Comedy,Thriller',
       'Horror,Sport,Thriller', 'Comedy,Music,Musical',
       'Action,Horror,Western', 'Action,Comedy,Music', 'Biography,Comedy',
       'Adventure,Animation,Mystery', 'History,War',
       'Comedy,Drama,Western', 'Animation,Horror,Mystery',
       'Comedy,Horror,Western', 'Comedy,Family,Western',
       'Drama,Thriller,Western', 'Family,Fantasy,History',
       'Animation,Horror', 'Adventure,Horror', 'Action,Adventure,Western',
       'Animation,Music', 'Romance,Sport', 'Fantasy,Mystery,Sci-Fi',
       'Biography,Drama,Horror', 'Animation,History',
       'Animation,Fantasy,Romance', 'Crime,Drama,Sci-Fi',
       'Biography,History,War', 'Action,Family', 'Crime,Thriller,War',
       'Crime,Fantasy,Horror', 'Action,Comedy,War',
       'Crime,Fantasy,Thriller', 'Animation,Family,History',
       'Horror,Musical,Sci-Fi', 'Animation,Crime,Music',
       'Animation,Crime,Mystery', 'Biography,Drama,Thriller',
       'Drama,Family,Music', 'Drama,History,Mystery', 'Family,Romance',
       'Comedy,Crime,History', 'Biography,Music', 'Drama,History,Sci-Fi',
       'Fantasy,Sport', 'Animation,Musical,Sport',
       'Family,History,Musical', 'Musical,Thriller', 'Reality-TV',
       'Animation,Family,Western', 'Action,Fantasy,History',
       'History,Horror,Thriller', 'Biography,Fantasy',
       'Fantasy,Mystery,Thriller', 'Adventure,Mystery,Romance',
       'Drama,History,Western', 'Music,Romance', 'Adult,Comedy,Horror',
       'Adventure,Family,Sci-Fi', 'Crime,Music,Romance',
       'Action,Family,Fantasy', 'Action,Sport,Thriller', 'Crime,Fantasy',
       'Comedy,Sci-Fi,Thriller', 'Animation,Musical,Romance',
       'Action,Animation,Fantasy', 'Animation,Drama,Musical',
       'Animation,Crime', 'Animation,Biography', 'Comedy,Horror,Sport',
       'Family,Fantasy,Horror', 'Fantasy,Horror,Musical',
       'Animation,Fantasy,Musical', 'Action,Horror,Romance',
       'Drama,News,Thriller', 'Comedy,Family,Musical',
       'Animation,Biography,Comedy', 'Comedy,History,Romance',
       'Adventure,Animation,Crime', 'Animation,Musical',
       'Adventure,Fantasy,Mystery', 'Biography,Family', 'Horror,Music',
       'Biography,Sport', 'Fantasy,Music,Mystery', 'Romance,Western',
       'Adult,Comedy,Drama', 'Adventure,Comedy,Musical', 'Family,Mystery',
       'Comedy,Reality-TV,Romance', 'Biography,Music,Mystery',
       'Action,Biography,Comedy', 'Fantasy,History,Romance',
       'Drama,Family,Thriller', 'Animation,Drama,Music',
       'Adventure,Horror,Musical', 'Drama,Horror,Music',
       'Adventure,Animation,History', 'Animation,Comedy,Romance',
       'Adventure,Family,Romance', 'Crime,Family,Mystery',
       'Adventure,Crime,Horror', 'History,Thriller',
       'Adventure,Fantasy,History', 'Adventure,Fantasy,Romance',
       'Adult,Music', 'Mystery,Romance', 'Family,Fantasy,Musical',
       'Biography,History,Western', 'Action,Animation,Thriller',
       'Comedy,Mystery,Sport', 'Biography,Musical',
       'Adventure,Animation,Horror', 'Action,History,Thriller',
       'Action,Crime,Sport', 'Adventure,Comedy,History',
       'Animation,Family,Romance', 'Adventure,Biography',
       'Musical,Sci-Fi', 'Drama,Musical,Thriller', 'Drama,News',
       'News,Talk-Show', 'Adventure,Crime', 'Drama,Mystery,War',
       'Biography,Comedy,Music', 'Talk-Show', 'Crime,Sci-Fi,Thriller',
       'Animation,Fantasy,Thriller', 'Drama,Musical,Mystery',
       'Fantasy,Sci-Fi,Thriller', 'Action,Comedy,Sport',
       'Animation,Fantasy,Music', 'News', 'Family,Fantasy,Music',
       'Fantasy,War', 'Animation,Crime,Sci-Fi', 'Crime,Romance,Sci-Fi',
       'Animation,Mystery,Thriller', 'Adventure,War',
       'Crime,Thriller,Western', 'Comedy,Musical,Mystery',
       'Adventure,Crime,Mystery', 'Family,Musical,Romance',
       'Biography,Crime,History', 'History,Music', 'Fantasy,History',
       'Adult,Comedy', 'Sci-Fi,Western', 'Music,Musical',
       'Action,Sci-Fi,War', 'Adult,Fantasy,Horror', 'Adult,Romance',
       'Crime,Fantasy,Romance', 'Comedy,Reality-TV', 'History,Horror',
       'Adult,Drama,Reality-TV', 'Action,Adventure,Sport',
       'Action,Mystery', 'Crime,History', 'Horror,Music,Musical',
       'Adult,Thriller', 'Adult,Drama,Fantasy', 'Action,Fantasy,Mystery',
       'Crime,War', 'Fantasy,Reality-TV,Romance', 'Game-Show',
       'Adventure,Mystery,Sci-Fi', 'Action,Animation,Musical',
       'Horror,Thriller,War', 'Reality-TV,Western',
       'Biography,Comedy,History', 'Adult,Horror', 'Romance,War',
       'Action,Fantasy,Romance', 'Romance,Sci-Fi,Thriller',
       'Musical,Sport', 'Fantasy,Romance,Sci-Fi',
       'Adventure,Crime,Thriller', 'Drama,Horror,War',
       'Adventure,Reality-TV', 'Comedy,Music,Thriller',
       'Biography,Romance', 'Music,Sport', 'Action,Crime,History',
       'Music,News', 'Adult,Fantasy,Romance', 'Drama,Musical,Sci-Fi',
       'Animation,Drama,Sport', 'Fantasy,Music',
       'Animation,Fantasy,Horror', 'Fantasy,Musical',
       'Animation,Comedy,War', 'Mystery,Thriller,Western',
       'Crime,History,Thriller', 'Comedy,Family,Thriller',
       'Adventure,Fantasy,Musical', 'Adventure,Biography,Crime',
       'Animation,Music,Sci-Fi', 'Adult,Drama,Mystery',
       'Drama,Music,Sci-Fi', 'Adventure,Drama,Musical',
       'Drama,Family,History', 'Adventure,Drama,Music',
       'Animation,Comedy,Mystery', 'Adult,Sci-Fi',
       'Adventure,Horror,Western', 'Fantasy,Music,Romance',
       'Drama,Family,Horror', 'Biography,Romance,War',
       'Comedy,Music,Mystery', 'Adult,Horror,Thriller',
       'History,Mystery,Thriller', 'Adventure,Comedy,War',
       'Animation,Mystery,Sci-Fi', 'Fantasy,Romance,Thriller',
       'Adventure,Biography,Thriller', 'Adventure,Crime,Romance',
       'Action,History,Horror', 'Adventure,Biography,History',
       'Comedy,Music,Sci-Fi', 'Animation,Thriller',
       'Drama,Fantasy,Western', 'Biography,History,Music',
       'Adult,Drama,Horror', 'Comedy,Thriller,Western',
       'Adventure,Fantasy,Music', 'Action,Crime,Music', 'Animation,Sport',
       'Family,Mystery,Thriller', 'Family,Fantasy,Sci-Fi', 'Family,Music',
       'Fantasy,Sci-Fi,Western', 'Animation,Biography,Fantasy',
       'Crime,Horror,Musical', 'Adventure,Family,Horror',
       'Action,Biography,History', 'Adult,Crime,Drama',
       'Biography,History,Thriller', 'Action,Family,Mystery',
       'Action,Animation,Game-Show', 'History,Thriller,War',
       'Adult,Animation,Drama', 'Adventure,History',
       'Adventure,History,Mystery', 'Comedy,Fantasy,Thriller',
       'Action,Comedy,History', 'Action,Romance,Sport',
       'Biography,History,Romance', 'Adventure,Crime,Family',
       'Animation,Family,Music', 'Comedy,History,Music',
       'Horror,Music,Mystery', 'Adventure,Family,Musical',
       'Action,Crime,Musical', 'Comedy,History,Mystery',
       'Fantasy,Musical,Sci-Fi', 'Animation,Biography,Sport',
       'Animation,Sci-Fi,Thriller', 'Adventure,History,Music',
       'Drama,Sci-Fi,Sport', 'Adventure,History,War',
       'Horror,Music,Thriller', 'Adventure,Drama,Western',
       'Animation,Biography,History', 'Animation,Fantasy,Mystery',
       'Fantasy,Horror,Music', 'Fantasy,Music,Sci-Fi',
       'Adventure,Crime,Sci-Fi', 'Drama,Sci-Fi,Western',
       'Comedy,Drama,News', 'Comedy,Musical,Western', 'History,Mystery',
       'Family,Horror,Thriller', 'Music,Reality-TV', 'Crime,Sci-Fi',
       'Comedy,Family,Horror', 'Animation,Comedy,Music',
       'Family,Fantasy,Western', 'Biography,Music,Musical',
       'Musical,Romance,Thriller', 'Music,Mystery,Romance',
       'Crime,Music,Mystery', 'Drama,Horror,Western',
       'Drama,Mystery,Western', 'Horror,Romance,Sci-Fi',
       'History,Western', 'Music,Musical,Romance',
       'Animation,Romance,Sci-Fi', 'History,Sci-Fi',
       'Adventure,Crime,Western', 'Drama,Sci-Fi,War',
       'Family,Music,Romance', 'Crime,Western', 'Reality-TV,Sport',
       'Drama,Mystery,Sport', 'Adventure,Music', 'Comedy,News',
       'Biography,History,Mystery', 'Animation,Family,Sport',
       'Animation,Biography,Family', 'Adventure,History,Western',
       'Action,Adventure,Musical', 'Action,Family,Western',
       'Animation,Mystery', 'Animation,Biography,Crime',
       'Adventure,History,Romance', 'Action,Musical',
       'Biography,History,Musical', 'Animation,Fantasy,Sci-Fi',
       'Crime,Family', 'Adventure,Music,Sci-Fi', 'Crime,Music,Thriller',
       'Biography,Family,Sport', 'Family,History,War',
       'Animation,Comedy,History', 'Comedy,Family,History',
       'Biography,Horror', 'Fantasy,Musical,Romance', 'Family,Sci-Fi',
       'History,Romance', 'Adventure,Romance,Sci-Fi',
       'Action,Musical,Sci-Fi', 'Family,Horror,Romance',
       'Biography,Comedy,Fantasy', 'Animation,War', 'Comedy,Music,War',
       'Crime,Musical,Thriller', 'Animation,Horror,Music',
       'Comedy,Crime,Western', 'Sport,Thriller',
       'Animation,Fantasy,History', 'Comedy,Sport,Western',
       'Action,Biography,Thriller', 'Biography,Crime,Romance',
       'Biography,Comedy,Family', 'Comedy,Sci-Fi,Sport',
       'Animation,Music,Musical', 'Action,Biography,Fantasy',
       'Family,History', 'Adult,Drama,Romance', 'History,Music,Sci-Fi',
       'Action,Animation,Mystery', 'Animation,History,Music',

In [47]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History",Drama
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...,...,...,...
81760,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81760,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81760,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81761,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
81761,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [48]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [49]:
#create the genres_split column
title_genres = exploded_genres[['tconst', 'genres_split']].copy() 
title_genres.head(10)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History
2  tt0062336        Drama
3  tt0069049        Drama
4  tt0088751       Comedy
4  tt0088751       Horror
4  tt0088751       Sci-Fi

In [50]:
## Making the genre mapper dictionary
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [51]:
# create a new genre_id column using the map and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_id_map)

In [52]:
#drop the old column
title_genres = title_genres.drop(columns='genres_split')

In [53]:
#convert the genre dictionary into a dataframe
genre_lookup=pd.DataFrame({'Genre_name': genre_id_map.keys(),
                          'Genre_id': genre_id_map.values()})

#### Save Basics to SQL

In [54]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [55]:
#double check the dataframe
print(df_schema)

{'tconst': String(length=11), 'primaryTitle': Text(length=243), 'startYear': Float(), 'runtimeMinutes': Integer()}

In [56]:
#drop the unneeded columns
basics_cleaned = basics.drop(columns=['titleType','originalTitle', 'isAdult', 'genres','genres_split', 'endYear'])

In [57]:
# Save to sql with dtype and index=False
basics_cleaned.to_sql('new_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81762

In [58]:
# add primary key
engine.execute('ALTER TABLE new_basics ADD PRIMARY KEY (`tconst`);')

### Ratings

In [59]:
#check the columns
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 503636 entries, 0 to 503635
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         503636 non-null  object
 1   averageRating  503636 non-null  float64
 2   numVotes       503636 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [60]:
#create schema
rating_schema = {'tconst':String(key_len+1), 
                 'averageRating':Float(),
                 'numVotes':Integer()}#get_schema(ratings)

In [61]:
# Save to sql with dtype and index=False
rating.to_sql('new_ratings',engine,dtype=rating_schema,if_exists='replace',index=False)

503636

In [62]:
# add primary key
engine.execute('ALTER TABLE new_ratings ADD PRIMARY KEY (`tconst`);')

### Genres

In [63]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('new_genres',engine,if_exists='replace',index=False)

25

In [64]:
#add primary key
engine.execute('ALTER TABLE new_genres ADD PRIMARY KEY (`Genre_ID`);')

In [65]:
# Save to sql with dtype and index=False
title_genres.to_sql('new_title_genres',engine,if_exists='replace',index=False)

153216

### Crew

In [66]:
crew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301945 entries, 0 to 301944
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    301945 non-null  object
 1   director  297701 non-null  object
 2   writer    272846 non-null  object
dtypes: object(3)
memory usage: 6.9+ MB

In [67]:
crew.head()

      tconst   director     writer
0  tt0035423  nm0003506  nm0737216
1  tt0035423  nm0003506  nm0003506
2  tt0062336  nm0749914  nm0749914
3  tt0062336  nm0749914  nm1146177
4  tt0062336  nm0765384  nm0749914

In [68]:
# melt crew and use tconst to vars
title_crew_melt=pd.melt(crew, id_vars='tconst',
                       var_name='role', value_name='nconst')

In [69]:
#replace roles
roles_to_replace = {'directors': 'director', 'writers':'writer'}
title_crew_melt['role']=title_crew_melt['role'].replace(roles_to_replace)
title_crew_melt

           tconst      role     nconst
0       tt0035423  director  nm0003506
1       tt0035423  director  nm0003506
2       tt0062336  director  nm0749914
3       tt0062336  director  nm0749914
4       tt0062336  director  nm0765384
...           ...       ...        ...
603885  tt9916170    writer  nm3245789
603886  tt9916190    writer  nm7308376
603887  tt9916362    writer  nm1893148
603888  tt9916362    writer  nm3471432
603889  tt9916428    writer        NaN

[603890 rows x 3 columns]

In [70]:
# Save to sql with dtype and index=False
crew.to_sql('crew',engine,if_exists='replace',index=False)

301945

### Name Basics

In [86]:
# look at names info
names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 592712 entries, 0 to 592711
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   nconst             592712 non-null  object
 1   primaryName        592712 non-null  object
 2   birthYear          101092 non-null  float64
 3   deathYear          13375 non-null   float64
 4   primaryProfession  549912 non-null  object
 5   knownForTitles     591685 non-null  object
 6   profession_split   549912 non-null  object
dtypes: float64(2), object(5)
memory usage: 31.7+ MB

In [85]:
#create a copy for first SQL table
name_basics=name.copy()

NameError: name 'name' is not defined

In [72]:
# look at profession
names['primaryProfession'].unique()

array(['soundtrack,actor,miscellaneous', 'actress,soundtrack',
       'actress,soundtrack,music_department', ...,
       'casting_department,transportation_department',
       'actor,cinematographer,set_decorator',
       'sound_department,writer,costume_department'], dtype=object)

In [73]:
## create a col with a list of genres
names['profession_split'] = names['primaryProfession'].str.split(',')
names

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles,profession_split
0,nm0000001,Fred Astaire,1899.0,1987.0,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983","[soundtrack, actor, miscellaneous]"
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0075213","[actress, soundtrack]"
2,nm0000003,Brigitte Bardot,1934.0,NaN,"actress,soundtrack,music_department","tt0056404,tt0054452,tt0049189,tt0057345","[actress, soundtrack, music_department]"
3,nm0000004,John Belushi,1949.0,1982.0,"actor,soundtrack,writer","tt0080455,tt0072562,tt0077975,tt0078723","[actor, soundtrack, writer]"
4,nm0000005,Ingmar Bergman,1918.0,2007.0,"writer,director,actor","tt0050976,tt0050986,tt0083922,tt0069467","[writer, director, actor]"
...,...,...,...,...,...,...,...
592707,nm9993444,Jason Winter,NaN,NaN,actor,"tt8743272,tt10540122,tt9795950",[actor]
592708,nm9993494,Amjad Ali,NaN,NaN,writer,"tt7722258,tt19813764",[writer]
592709,nm9993616,Ryan Mac Lennan,NaN,NaN,actor,tt4844148,[actor]
592710,nm9993680,Christopher-Lawson Palmer,NaN,NaN,actor,"tt10427366,tt21745568,tt8295580,tt21047844",[actor]
592711,nm9993693,Apsara Rani,1996.0,NaN,actress,"tt12856788,tt13847502,tt8302382,tt8737752",[actress]

In [74]:
## create a col with a list of professions
#create a column
profession_split =names['primaryProfession'].str.split(',')

unique_profession=profession_split.explode().unique()
unique_profession

array(['soundtrack', 'actor', 'miscellaneous', 'actress',
       'music_department', 'writer', 'director', 'producer', 'stunts',
       'make_up_department', 'composer', 'assistant_director',
       'music_artist', 'editor', 'cinematographer', 'camera_department',
       'casting_director', 'script_department', 'costume_department',
       'animation_department', 'art_department', 'executive',
       'special_effects', 'production_designer', 'production_manager',
       'editorial_department', 'sound_department', 'talent_agent',
       'casting_department', 'costume_designer', 'art_director',
       'visual_effects', 'location_management', 'set_decorator',
       'transportation_department', 'manager', nan, 'legal', 'assistant',
       'podcaster', 'publicist', 'production_department',
       'electrical_department'], dtype=object)

In [75]:
#explode profession
exploded_profession = names.explode('profession_split')
exploded_profession

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles,profession_split
0,nm0000001,Fred Astaire,1899.0,1987.0,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983",soundtrack
0,nm0000001,Fred Astaire,1899.0,1987.0,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983",actor
0,nm0000001,Fred Astaire,1899.0,1987.0,"soundtrack,actor,miscellaneous","tt0050419,tt0072308,tt0053137,tt0031983",miscellaneous
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0075213",actress
1,nm0000002,Lauren Bacall,1924.0,2014.0,"actress,soundtrack","tt0038355,tt0037382,tt0117057,tt0075213",soundtrack
...,...,...,...,...,...,...,...
592707,nm9993444,Jason Winter,NaN,NaN,actor,"tt8743272,tt10540122,tt9795950",actor
592708,nm9993494,Amjad Ali,NaN,NaN,writer,"tt7722258,tt19813764",writer
592709,nm9993616,Ryan Mac Lennan,NaN,NaN,actor,tt4844148,actor
592710,nm9993680,Christopher-Lawson Palmer,NaN,NaN,actor,"tt10427366,tt21745568,tt8295580,tt21047844",actor
592711,nm9993693,Apsara Rani,1996.0,NaN,actress,"tt12856788,tt13847502,tt8302382,tt8737752",actress

In [76]:
#create the genres_split column
title_profession = exploded_profession[['nconst', 'primaryName','profession_split']].copy() 
title_profession.head(10)

      nconst      primaryName  profession_split
0  nm0000001     Fred Astaire        soundtrack
0  nm0000001     Fred Astaire             actor
0  nm0000001     Fred Astaire     miscellaneous
1  nm0000002    Lauren Bacall           actress
1  nm0000002    Lauren Bacall        soundtrack
2  nm0000003  Brigitte Bardot           actress
2  nm0000003  Brigitte Bardot        soundtrack
2  nm0000003  Brigitte Bardot  music_department
3  nm0000004     John Belushi             actor
3  nm0000004     John Belushi        soundtrack

In [77]:
## Making the profession mapper dictionary
profession_id_map = dict(zip(unique_profession, range(len(unique_profession))))
profession_id_map

{'soundtrack': 0,
 'actor': 1,
 'miscellaneous': 2,
 'actress': 3,
 'music_department': 4,
 'writer': 5,
 'director': 6,
 'producer': 7,
 'stunts': 8,
 'make_up_department': 9,
 'composer': 10,
 'assistant_director': 11,
 'music_artist': 12,
 'editor': 13,
 'cinematographer': 14,
 'camera_department': 15,
 'casting_director': 16,
 'script_department': 17,
 'costume_department': 18,
 'animation_department': 19,
 'art_department': 20,
 'executive': 21,
 'special_effects': 22,
 'production_designer': 23,
 'production_manager': 24,
 'editorial_department': 25,
 'sound_department': 26,
 'talent_agent': 27,
 'casting_department': 28,
 'costume_designer': 29,
 'art_director': 30,
 'visual_effects': 31,
 'location_management': 32,
 'set_decorator': 33,
 'transportation_department': 34,
 'manager': 35,
 nan: 36,
 'legal': 37,
 'assistant': 38,
 'podcaster': 39,
 'publicist': 40,
 'production_department': 41,
 'electrical_department': 42}

In [78]:
# create a new profession column using the map and drop string genres
title_profession['profession_id'] = title_profession['profession_split'].map(profession_id_map)

In [79]:
#drop the old column
title_profession = title_profession.drop(columns='profession_split')

In [80]:
#double check
title_profession.head(2)

      nconst   primaryName  profession_id
0  nm0000001  Fred Astaire              0
0  nm0000001  Fred Astaire              1

In [81]:
#convert the genre dictionary into a dataframe
profession_lookup=pd.DataFrame({'profession_name': genre_id_map.keys(),
                          'profession_id': genre_id_map.values()})

In [82]:
# Save to sql with dtype and index=False
profession_lookup.to_sql('profession',engine,if_exists='replace',index=False)

25

In [83]:
#add primary key
engine.execute('ALTER TABLE profession ADD PRIMARY KEY (`profession_id`);')

In [84]:
# Save to sql with dtype and index=False
title_profession.to_sql('title_profession',engine,if_exists='replace',index=False)

1186645